Domaine/2015/lab/ex4/solution.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-10-12 lun. 14:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="fmarch12" />
</head>
<body>
<div id="content">
<p>
In <code>views.py</code>, add a view for the list of users fragment:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">friends</span><span style="color: #2aa198;">(</span>req, user<span style="color: #2aa198;">)</span>:
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">When no used is specified, return all users</span>
    <span style="color: #859900; font-weight: bold;">if</span> user <span style="color: #859900; font-weight: bold;">is</span> <span style="color: #268bd2; font-weight: bold;">None</span>:
        <span style="color: #268bd2;">users</span> =  load_users<span style="color: #2aa198;">()</span>
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Otherwise, only return users whose name contain the parameter</span>
    <span style="color: #859900; font-weight: bold;">else</span>:
        <span style="color: #268bd2;">users</span> = <span style="color: #2aa198;">[</span>u <span style="color: #859900; font-weight: bold;">for</span> u <span style="color: #859900; font-weight: bold;">in</span> load_users<span style="color: #b58900;">()</span> <span style="color: #859900; font-weight: bold;">if</span> user <span style="color: #859900; font-weight: bold;">in</span> u.name<span style="color: #2aa198;">]</span>

    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Render only the list of users using the fragment template</span>
    <span style="color: #859900; font-weight: bold;">return</span> render<span style="color: #2aa198;">(</span>req, <span style="color: #2aa198;">"fragments/users.html"</span>, <span style="color: #b58900;">{</span><span style="color: #2aa198;">"users"</span> : users<span style="color: #b58900;">}</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Add an URL for this view in <code>urls.py</code>:
</p>

<div class="org-src-container">

<pre class="src src-python">    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Request URL with a parameter that is passed to the view.</span>
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">See https://docs.djangoproject.com/en/1.7/topics/http/urls/#named-groups</span>
    url<span style="color: #2aa198;">(</span>r<span style="color: #2aa198;">'^friends/(?P&lt;user&gt;\w+)?'</span>, views.friends, name=<span style="color: #2aa198;">"friends"</span><span style="color: #2aa198;">)</span>,
</pre>
</div>

<p>
Somewhere in your <code>index.html</code> template, add (and copy Zepto from exercise 3 to
your static folder):
</p>

<div class="org-src-container">

<pre class="src src-html">  &lt;<span style="color: #268bd2;">script</span> <span style="color: #268bd2;">src</span>=<span style="color: #2aa198;">"{% static 'zepto.min.js' %}"</span>&gt;&lt;/<span style="color: #268bd2;">script</span>&gt;
  &lt;<span style="color: #268bd2;">script</span> <span style="color: #268bd2;">src</span>=<span style="color: #2aa198;">"{% static 'interact.js' %}"</span>&gt;&lt;/<span style="color: #268bd2;">script</span>&gt;
</pre>
</div>

<p>
In the file <code>interact.js</code>:
</p>

<div class="org-src-container">

<pre class="src src-js2">$<span style="color: #2aa198;">(</span>init<span style="color: #2aa198;">)</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">init</span><span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
  <span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">On change of input in the friendlist filter.</span>
  $<span style="color: #b58900;">(</span><span style="color: #2aa198;">'[name=filter-friends]'</span><span style="color: #b58900;">)</span>.on<span style="color: #b58900;">(</span><span style="color: #2aa198;">'input'</span>, refreshFriendlist<span style="color: #b58900;">)</span>
<span style="color: #2aa198;">}</span>

<span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">Replace the `ul` containing the list of friends with the HTML from the</span>
<span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">fragment template.</span>
<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">refreshFriendlist</span><span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
  <span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">$input</span> = $<span style="color: #b58900;">(</span><span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #b58900;">)</span>
  <span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">$ul</span> = $input.siblings<span style="color: #b58900;">(</span><span style="color: #2aa198;">'.users'</span><span style="color: #b58900;">)</span>
  $.get<span style="color: #b58900;">(</span><span style="color: #2aa198;">'/friends/'</span> + $input.val<span style="color: #268bd2;">()</span>, <span style="color: #859900; font-weight: bold;">function</span><span style="color: #268bd2;">(</span><span style="color: #268bd2;">users</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
    $ul.html<span style="color: #6c71c4;">(</span>users<span style="color: #6c71c4;">)</span>
  <span style="color: #268bd2;">}</span><span style="color: #b58900;">)</span>
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</body>
</html>
